tutorials/compressible/rhoPorousSimpleFoam/porousPlug/constant/porousZones
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porousZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

1
(
    poro
    {
        coordinateSystem
        {
            e1  (1 0 0);
            e2  (0 1 0);
        }

        // Da =0.01 = K/H² = K/0.1^2 -> K=1e-4
        // Da =0.001 = K/H² = K/0.1^2 -> K=1e-5
        // ce = 0.2439 -> sqrt(1/K) * ce (24.39 bzw 77.12)
        Darcy
        {
            d   d [0 -2 0 0 0 0 0] (1e5 1e5 1e5);
            f   f [0 -1 0 0 0 0 0] (77.12 77.12 77.12);
            //            d   d [0 -2 0 0 0 0 0] (1e4 1e4 1e4);
            //            f   f [0 -1 0 0 0 0 0] (24.39 24.39 24.39);
        }
    }
)

// ************************************************************************* //
